DOMAIN = "wirenboard"
INPUT_MODE_VALUES = {
    0: "Кнопка без фиксации",
    1: "Переключатель с фиксацией",
    2: "Отключить все выходы",
    3: "Управление отключено, вход измеряет частоту",
    4: "Управлять по mapping-матрице",
    6: "Управлять по mapping-матрице для кнопок",
}
INPUT_MODE_VALUES_0 = {
    2: "Отключить все выходы",
    3: "Управление отключено, вход измеряет частоту",
    4: "Управлять по mapping-матрице",
    6: "Управлять по mapping-матрице для кнопок",
}
STATUS_OUTPUTS_WHEN_POWER_APPLIED = {
    0: "Перевести в безопасное состояние",
    1: "Восстановить последнее состояние",
    2: "Установить состояние выхода согласно состоянию входа",
}